tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "jpeg"
brew "libpng"
brew "python@3.9"
brew "asciinema"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "awscli@1"
brew "bat"
brew "bzip2"
brew "python@3.8"
brew "pkg-config"
brew "gnutls"
brew "emacs"
brew "cask"
brew "deno"
brew "diff-so-fancy"
brew "diffutils"
brew "dive"
brew "ed"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "gawk"
brew "gh"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"
brew "httpie"
brew "iproute2mac"
brew "oniguruma"
brew "jq"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libzip"
brew "marp-cli"
brew "mas"
brew "minikube"
brew "mysql"
brew "neovim"
brew "nkf"
brew "pastel"
brew "plantuml"
brew "pstree"
brew "re2c"
brew "starship"
brew "telnet"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "watchexec"
brew "wget"
brew "zlib"
brew "zsh"
cask "brave-browser"
cask "deckset"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "numi"
cask "phpstorm"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"
mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Presentify", id: 1507246666
mas "RunCat", id: 1429033973
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
