tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "asciinema"
brew "asdf"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "bottom"
brew "coreutils"
brew "diffutils"
brew "dive"
brew "dust"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "grex"
brew "httpie"
brew "hyperfine"
brew "iproute2mac"
brew "jq"
brew "marp-cli"
brew "mas"
brew "minikube"
brew "neovim"
brew "nkf"
brew "openssl@3"
brew "pandoc"
brew "pdm"
brew "pipx"
brew "procs"
brew "pstree"
brew "ripgrep"
brew "sd"
brew "telnet"
brew "tmux"
brew "tokei"
brew "tree"
brew "watchexec"
brew "wget"
brew "yq"
brew "zellij"
brew "zoxide"
cask "1password"
cask "airbuddy"
cask "alt-tab"
cask "bartender"
cask "brave-browser"
cask "deepl"
cask "discord"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "iterm2"
cask "miro"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "pushplaylabs-sidekick"
cask "raycast"
cask "sketch"
cask "slack"
cask "spotify"
cask "stats"
cask "visual-studio-code"
cask "vivaldi"
cask "zoom"
mas "DaisyDisk", id: 411643860
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Presentify", id: 1507246666
mas "RunCat", id: 1429033973
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
